001_Конспекты_2/src/Catalogs/Темы/Темы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Темы</name>
  <attributes>
    <name>Лекция</name>
    <type>
      <types>CatalogRef.Лекции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заметки</name>
    <attributes>
      <name>Заметка</name>
      <type>
        <types>CatalogRef.Заметки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

001_Конспекты_2/src/Catalogs/Темы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
	//Вставка нач страницы
	//добавление в нее элементов
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьАвтоматическиПриИзменении(Элемент)
	ЗаполнятьАвтоматическиПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнятьАвтоматическиПриИзмененииНаСервере()
	Если Объект.ЗаполнятьАвтоматически Тогда
		Объект.Заметки.Очистить();
				
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Заметки.Ссылка КАК Заметка
			|ИЗ
			|	Справочник.Заметки КАК Заметки
			|ГДЕ
			|	Заметки.Тема = &Тема";
		
		Запрос.УстановитьПараметр("Тема", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = Объект.Заметки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры
#КонецОбласти
